Revit 2027 API
ParameterTypeId.ProfileOffsetX Property
 "Horizontal Profile Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ProfileOffsetX { get; }
Public Shared ReadOnly Property ProfileOffsetX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ProfileOffsetX {
	ForgeTypeId^ get ();
}
static member ProfileOffsetX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace